БукмекерскаяКонтора/src/Documents/ЗапросНаПополнение/ЗапросНаПополнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаПополнение</name>
  <registerRecords>AccumulationRegister.ЗапросНаПополнение</registerRecords>
  <attributes>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПополнениеДепозита</name>
    <type>
      <types>DocumentRef.ПополнениеДепозита</types>
    </type>
  </attributes>
</mdclass:Document>

БукмекерскаяКонтора/src/AccumulationRegisters/ЗапросНаПополнение/ЗапросНаПополнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗапросНаПополнение</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БукмекерскаяКонтора/src/Enums/СтатусПлатежа/СтатусПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусПлатежа</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

БукмекерскаяКонтора/src/Documents/ПополнениеДепозита/ПополнениеДепозита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПополнениеДепозита</name>
  <registerRecords>AccumulationRegister.Депозиты</registerRecords>
  <registerRecords>AccumulationRegister.ЗапросНаПополнение</registerRecords>
  <attributes>
    <name>ЗапросНаПополнение</name>
    <type>
      <types>DocumentRef.ЗапросНаПополнение</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

БукмекерскаяКонтора/src/Documents/ЗапросНаПополнение/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ОтправитьСсылку(Отказ);
	
	Если не Отказ тогда
		Движения.ЗапросНаПополнение.Записывать = Истина;
		Движение = Движения.ЗапросНаПополнение.ДобавитьПриход();
		Движение.Игрок = Игрок;
		Движение.Сумма = СуммаПлатежа;
		Движение.Период = Дата;
		
		Документ = Документы.ПополнениеДепозита.СоздатьДокумент();
		Документ.ЗапросНаПополнение = Ссылка;
		Документ.Статус = ПредопределенноеЗначение("Перечисление.СтатусПлатежа.НаРассмотрении");
		Документ.Дата = Дата;
		Документ.Записать();
		
		ЭтотОбъект.ПополнениеДепозита = Документ.Ссылка;
		ЭтотОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОтправитьСсылку(Отказ)
	Профиль = Новый ИнтернетПочтовыйПрофиль();
	Профиль.АдресСервераSMTP = "smtp.gmail.com";		
	Профиль.ПользовательSMTP = "sayahov1998@gmail.com";
	Профиль.ПарольSMTP = "EnigmaCode";
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
		
	Сообщение = Новый ИнтернетПочтовоеСообщение();
	Сообщение.Отправитель = "sayahov1998@gmail.com";
	Сообщение.Тема = "Пополнение депозита";
	Сообщение.Получатели.Добавить(Игрок.ЭлектроннаяПочта);
	Сообщение.Тексты.Добавить("Ссылка на оплату счета на " + СуммаПлатежа + " руб. номер " + Номер);
		
	Почта = Новый ИнтернетПочта();
	Попытка 
		Почта.Подключиться(Профиль);
		Почта.Послать(Сообщение);
		Сообщить("На почтовый адрес " + Игрок.ЭлектроннаяПочта + " отправлена ссылка для оплаты");
	Исключение
		Сообщить(""+ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры
